v1-monolithic-architecture/load-test-results/health_check_20260113_213408.txt

Summary:
  Total:	6.8092 secs
  Slowest:	1.9874 secs
  Fastest:	0.2208 secs
  Average:	0.4747 secs
  Requests/sec:	14.6859
  
  Total data:	9500 bytes
  Size/request:	95 bytes

Response time histogram:
  0.221 [1]	|■
  0.397 [76]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.574 [3]	|■■
  0.751 [4]	|■■
  0.927 [2]	|■
  1.104 [0]	|
  1.281 [5]	|■■■
  1.457 [2]	|■
  1.634 [2]	|■
  1.811 [1]	|■
  1.987 [4]	|■■


Latency distribution:
  10% in 0.2282 secs
  25% in 0.2368 secs
  50% in 0.2696 secs
  75% in 0.3955 secs
  90% in 1.2791 secs
  95% in 1.7686 secs
  99% in 1.9874 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0666 secs, 0.2208 secs, 1.9874 secs
  DNS-lookup:	0.0533 secs, 0.0000 secs, 0.4656 secs
  req write:	0.0004 secs, 0.0000 secs, 0.0232 secs
  resp wait:	0.3517 secs, 0.2194 secs, 1.7855 secs
  resp read:	0.0007 secs, 0.0000 secs, 0.0117 secs

Status code distribution:
  [200]	100 responses