v1-monolithic-architecture/load-test-results/spike_test_20260113_224722.txt

Summary:
  Total:	23.7678 secs
  Slowest:	3.6780 secs
  Fastest:	0.1622 secs
  Average:	0.3941 secs
  Requests/sec:	84.1475
  
  Total data:	2674663 bytes
  Size/request:	1338 bytes

Response time histogram:
  0.162 [1]	|
  0.514 [1616]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.865 [119]	|■■■
  1.217 [199]	|■■■■■
  1.569 [28]	|■
  1.920 [23]	|■
  2.272 [8]	|
  2.623 [2]	|
  2.975 [2]	|
  3.326 [0]	|
  3.678 [1]	|


Latency distribution:
  10% in 0.1680 secs
  25% in 0.1781 secs
  50% in 0.2332 secs
  75% in 0.3764 secs
  90% in 0.9559 secs
  95% in 1.0538 secs
  99% in 1.7231 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0429 secs, 0.1622 secs, 3.6780 secs
  DNS-lookup:	0.0521 secs, 0.0000 secs, 0.5343 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0076 secs
  resp wait:	0.2767 secs, 0.1621 secs, 2.9447 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.4321 secs

Status code distribution:
  [200]	1999 responses

Error distribution:
  [1]	Get "https://ticketingsystem-production-4a1d.up.railway.app/events": context deadline exceeded (Client.Timeout exceeded while awaiting headers)